_Rarzrabotki/Kazna/AccumulationRegisters/ДенежныеСредстваВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ДенежныеСредстваВПути/Ext/RecordSetModule.bsl
Процедура ВыполнитьДвижение(Объект, ВидДвижения)
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	НоваяСтрока = Добавить();
	НоваяСтрока.Период = Объект.Дата;
	НоваяСтрока.ВидДвижения = ВидДвижения;
	НоваяСтрока.Местонахождение = Объект.Контрагент;
	НоваяСтрока.Организация = Объект.Организация;	
	НоваяСтрока.Валюта = Объект.ВалютаДокумента;
	НоваяСтрока.Сумма = Объект.СуммаДокумента;
	
	Если МетаданныеОбъекта.Реквизиты.Найти("Подразделение")<>Неопределено Тогда
		НоваяСтрока.Подразделение = Объект.Подразделение;
	КонецЕсли;	
	
	Если ВидДвижения=ВидДвиженияНакопления.Приход Тогда
		Если  Объект.Оплачено Тогда
			Если НачалоДня(Объект.Дата)=НачалоДня(Объект.ДатаОплаты) Тогда
				 НоваяСтрока.Период = Объект.Дата;
			Иначе	
			     НоваяСтрока.Период = Объект.ДатаОплаты;
			КонецЕсли;
			
		Иначе
			НоваяСтрока.План = Истина; 
		КонецЕсли;
	КонецЕсли;
	
	Записывать = Истина;
	
КонецПроцедуры

Процедура ВыполнитьПриход(Объект) Экспорт
	
	ВыполнитьДвижение(Объект, ВидДвиженияНакопления.Приход);
	
КонецПроцедуры

Процедура ВыполнитьРасход(Объект) Экспорт
	
	ВыполнитьДвижение(Объект, ВидДвиженияНакопления.Расход);
	
КонецПроцедуры
